In [1]:
import pandas as pd
import random
from deflator import deflate

Building a synthetic dataset:

In [2]:
yearly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2000", end="2018", freq="Y")
        .strftime("%Y"),
        "value": [random.random()*100 for i in range(len(pd.date_range(start="2000", end="2018", freq="Y")))],
    }
)
yearly_df.head()

   date      value
0  2000  47.617167
1  2001  19.431718
2  2002  52.585559
3  2003  76.327684
4  2004  31.676028

In [3]:
# using the function with a yearly value deflating to  IPCA's 2005 values:

deflate(
    data_frame=yearly_df, 
    value_column="value", 
    date_column="date", 
    deflate_year=2005
).head(10)

   date      value  deflated_value
0  2000  47.617167       45.342812
1  2001  19.431718       14.407033
2  2002  52.585559       23.875869
3  2003  76.327684       46.690491
4  2004  31.676028       23.713693
5  2005  37.964039       37.964039
6  2006   6.985761       12.651082
7  2007  61.161411       78.059172
8  2008  30.542793       29.438081
9  2009   7.334196        9.677479

When using monthly values, the date column **must** have the **"YYYY-MM"** format as `object`:

In [4]:
# monthly synthetic dataset:

monthly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2001", end="2006", freq="M").strftime("%Y-%m"),
        "value": [
            random.random()*100
            for i in range(len(pd.date_range(start="2001", end="2006", freq="M")))
        ],
    }
)
monthly_df.head()

      date      value
0  2001-01   8.355118
1  2001-02  47.416065
2  2001-03  59.437068
3  2001-04  31.572450
4  2001-05  10.242601

In [5]:
#deflating the series to IPCA's 2001-04 values:
deflate(
    data_frame=monthly_df,
    value_column="value",
    date_column="date",
    deflate_year=2001,
    deflate_month=4,
).head(10)

      date      value  deflated_value
0  2001-01   8.355118        8.501699
1  2001-02  47.416065       59.785473
2  2001-03  59.437068       90.719736
3  2001-04   31.57245        31.57245
4  2001-05  10.242601       14.489533
5  2001-06  59.317797       66.162158
6  2001-07  73.180969       31.913505
7  2001-08  81.041047       67.148296
8  2001-09  64.767633      134.161526
9  2001-10  77.556498       54.196107